let bookshelf = [];

const addNewBook = () => {
  console.log("Run a addNewBook fuction");
};

const main = () => {
  const mainOption = prompt(
    `ยินดีต้องรับเข้าสู่ "ระบบจัดการหนังสือ" 
กรุณาเลือกรายการที่ต้องการ โดยกรอก 
1: เพิ่มหนังสือใหม่ 
2: ดูรายการหนังสือทั้งหมด
3: แก้ไขหนังสือที่มีอยู่
4: ลบหนังสือที่มีอยู่`
  );

  switch (mainOption) {
    case "1": {
      addNewBook();
      break;
    }
    default: {
      alert(`กรุณาเลือกรายการที่ต้องการ โดยกรอก 
1: เพิ่มหนังสือใหม่ 
2: ดูรายการหนังสือทั้งหมด
3: แก้ไขหนังสือที่มีอยู่
4: ลบหนังสือที่มีอยู่
เท่านั้น!!`);
      main();
    }
  }
};

main();
